In [3]:
import pandas as pd

data={
    "calories":[420,380,390],
    "duration":[50,40,45],
    "age":[25,30,None]

}
#load data into a dataframe object:
df=pd.DataFrame(data)
df

   calories  duration   age
0       420        50  25.0
1       380        40  30.0
2       390        45   NaN

In [4]:
df=df.dropna()

In [5]:
df

   calories  duration   age
0       420        50  25.0
1       380        40  30.0

In [7]:
import pandas as pd

data1={
    "weight":[34.0,46.0,None],
    "Name":["anu","manu","adith"],
    "age":[25,30,23]
}
df1=pd.DataFrame(data1)
df1

   weight   Name  age
0    34.0    anu   25
1    46.0   manu   30
2     NaN  adith   23

In [8]:
df1=df1.fillna({'weight':42})
df1

   weight   Name  age
0    34.0    anu   25
1    46.0   manu   30
2    42.0  adith   23